#  ALPC 之殇 - 8月未知 Windows 在野提权 Nday 漏洞研究   
 奇安信 CERT   2025-01-09 00:01  
  
综述  
  
该漏洞样本为前段时间奇安信威胁情报中心日常在野漏洞监控运营经发现，其最早被上传时只有6个查杀。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmS6B6eD5WlBrIb1ymOO4BLwcShicXfr8n8KYcjuWGTTjxmL9lbTUFdQjw/640?wx_fmt=png&from=appmsg "")  
  
  
经过分析确认该漏洞应该是在八月的微软补丁中被修复，是一个被修复的未知nday利用，运行的具体效果如下所示。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmS0Qr4sI7mCic1PphsgQu5K2qDMUs19eD0I05BCRtSvF5o4Gh1Za3qd9A/640?wx_fmt=png&from=appmsg "")  
  
  
漏洞样本分析  
  
这里首先过一下整个样本，样本开始首先启动了一个cmd，之后调用核心fun_vulstar。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmShO9wqChtS7ia25uVKjoO8fZtyNRdHpBGKbl1eSQq82MiaWQsBcAHFwJA/640?wx_fmt=png&from=appmsg "")  
  
  
fun_vulstar中判断当前的机器的相关版本。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSqRzrib0KQtEULmoRKLbyqBy8miapEONKoCqFp9Hxk8dpMBhkpKx5FkzA/640?wx_fmt=png&from=appmsg "")  
  
  
之后动态获取部分系统api的函数地址。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSkEFvOn1XOeib7GR9vNO9tcEYXjiatE1znibHm8rskibwJ025lBnflBmplw/640?wx_fmt=png&from=appmsg "")  
  
  
开启一个新线程，调用漏洞利用函数fun_expProc。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSZU0jb1GYkDr8Mjn6FkTowEpVicO5jVYZooYjb9l25TtSQ655ym9qiaNg/640?wx_fmt=png&from=appmsg "")  
  
  
fun_expProc调用fun_IoRingandPipeinit。  
  

LpcRequestPort如下所示，最终发送通过AlpcpSendMessage实现，实际上Lpc是Windows中Vista之前内部进程进行通信的一种机制，Vsita后被替换为更高效的Alpc，为了保持兼容，可以看到所有的Lpc调用本质上最终都是转向了Alpc  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSNpwhezBY0wpSRn1ic9xSEKUiaYJerW6kmpuwiclARiaYTicK1T9k60MOAvQ/640?wx_fmt=png&from=appmsg "")  
  
  
而我们这里的alpc porthandler实际上同样是pdc alpc port服务对应的alpc端口，其对应的驱动是pdc.sys。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSw0ZBBNGZ2EBm7zYHlbF2l5eZKvHNAK8iahMrQQiaEnpGiazxjVcb3V4Gw/640?wx_fmt=png&from=appmsg "")  
  
  
而进入PdcProcessMessage后，其中有一个分支用于处理LPC_TERMINATION_MESSAGE，如下其判断的正是我们刚才发送的消息300008006中+4的6的位置，而这里PdcFreeClient将用于释放poi(poi(MessageAttribute)+0x20)，而该释放的位置之后应该是被exp中占据，并修改为了一段恶意的内存，该恶意内存中poi(poi(evil+0x20)+0x6c8)指向了一段var_KWorkerHandleaddr，从而在函数KeSetEvent中传入poi(poi(poi(poi(MessageAttribute)+0x20)+0x20)+0x6c8)并修改  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSAKNJGOByUjibwfR7cAbhdR98AdicenG76c0tic8fHEVKSDsCw23YHAEIQ/640?wx_fmt=png&from=appmsg "")  
  
  
那我们接下来的问题就是需要确认：  
  
1.是否是PdcFreeClient造成释放，并之后被重用  
  
2.问题1成立的情况下，这段释放的内存是什么，如何生成的，其为什么在系统发送的LPC_TERMINATION_MESSAGE消息及我们通过NtAlpcSendWaitReceivePort发送触发的消息之间没有修改  
  
3.如何实现的内存占据，我们的猜测是NtCreateEvent，毕竟代码中部NtCreateEvent的spray的操作过于明显。  
  
   
当对应的绑定线程退出时，触发LpcRequestPort的调用，内核将向对应的pdc alpc port服务发送一条300008开头的LPC_TERMINATION_MESSAGE消息。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSTnqKhTTDq2lxUfHypIKGMvvSWWl2mwTjP7YsKGJicd0OnAu0tWgic8BA/640?wx_fmt=png&from=appmsg "")  
  
  
pdc alpc port服务在pdc.sys的PdcpAlpcProcessMessages函数中处理接受的消息，如前文所说，alpc中的消息是由内核路由，这里调用ZwAlpcSendWaitReceivePort接受消息，由于此处ZwAlpcSendWaitReceivePort中指定了ReceiveMessageAttributes(v5)，因此内核在路由该消息时也会生成该数据，哪怕实际发送发送方发并没有发送。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSOJXNfTkCJwibR3QHia7CUMo1LojtnVUYquTTIG6WlQyF4nEaPtgVRJ6Q/640?wx_fmt=png&from=appmsg "")  
  
  
PdcpAlpcProcessMessages中调用ZwAlpcSendWaitReceivePort前，通过AlpcInitializeMessageAttribute创建一个ReceiveMessageAttributes的对象。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSGpV1pWLj3lDhlBz73lONMjJQ9wzaJmClhhC2EKlISXic0P3iaBjMiaBBQ/640?wx_fmt=png&from=appmsg "")  
  
  
ZwAlpcSendWaitReceivePort调用，实际还是进入到内核中的NtAlpcSendWaitReceivePort，并进入AlpcpReceiveMessage，并调用AlpcpReceiveMessagePort。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmStYuny4QEdMwiaMUOMAfNuCtnneDw7CY0Ficn1XyAJ1KYLBUsBJYALcYQ/640?wx_fmt=png&from=appmsg "")  
  
  
如下所示，AlpcpReceiveMessagePort的核心在于返回接受消息对应的_KALPC_MESSAGE。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSM6w8WpjJQwW9cGY3bgictJwWFy9BgbWxQMZPicp9wo63gNw9BFDjw1Dg/640?wx_fmt=png&from=appmsg "")  
  
  
这里对应的server connection port端口对象如下所示。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSr7oMGDwtURVQQIFp9TBnMvLG65bx7SsEfRf9d2hyWENs0IRHKb8yXQ/640?wx_fmt=png&from=appmsg "")  
  
  
nt!_ALPC_PORT的整体结构如下。  
```
0: kd> dt nt!_ALPC_PORT
   +0x000 PortListEntry    : _LIST_ENTRY
   +0x010 CommunicationInfo : Ptr64 _ALPC_COMMUNICATION_INFO
   +0x018 OwnerProcess     : Ptr64 _EPROCESS
   +0x020 CompletionPort   : Ptr64 _KQUEUE
   +0x028 CompletionKey    : Ptr64 Void
   +0x030 CompletionPacketLookaside : Ptr64 _ALPC_COMPLETION_PACKET_LOOKASIDE
   +0x038 PortContext      : Ptr64 Void
   +0x040 StaticSecurity   : _SECURITY_CLIENT_CONTEXT
   +0x088 IncomingQueueLock : _EX_PUSH_LOCK
   +0x090 MainQueue        : _LIST_ENTRY
   +0x0a0 LargeMessageQueue : _LIST_ENTRY
   +0x0b0 PendingQueueLock : _EX_PUSH_LOCK
   +0x0b8 PendingQueue     : _LIST_ENTRY
   +0x0c8 DirectQueueLock  : _EX_PUSH_LOCK
   +0x0d0 DirectQueue      : _LIST_ENTRY
   +0x0e0 WaitQueueLock    : _EX_PUSH_LOCK
   +0x0e8 WaitQueue        : _LIST_ENTRY
   +0x0f8 Semaphore        : Ptr64 _KSEMAPHORE
   +0x0f8 DummyEvent       : Ptr64 _KEVENT
   +0x100 PortAttributes   : _ALPC_PORT_ATTRIBUTES
   +0x148 ResourceListLock : _EX_PUSH_LOCK
   +0x150 ResourceListHead : _LIST_ENTRY
   +0x160 PortObjectLock   : _EX_PUSH_LOCK
   +0x168 CompletionList   : Ptr64 _ALPC_COMPLETION_LIST
   +0x170 CallbackObject   : Ptr64 _CALLBACK_OBJECT
   +0x178 CallbackContext  : Ptr64 Void
   +0x180 CanceledQueue    : _LIST_ENTRY
   +0x190 SequenceNo       : Int4B
   +0x194 ReferenceNo      : Int4B
   +0x198 ReferenceNoWait  : Ptr64 _PALPC_PORT_REFERENCE_WAIT_BLOCK
   +0x1a0 u1               : <unnamed-tag>
   +0x1a8 TargetQueuePort  : Ptr64 _ALPC_PORT
   +0x1b0 TargetSequencePort : Ptr64 _ALPC_PORT
   +0x1b8 CachedMessage    : Ptr64 _KALPC_MESSAGE
   +0x1c0 MainQueueLength  : Uint4B
   +0x1c4 LargeMessageQueueLength : Uint4B
   +0x1c8 PendingQueueLength : Uint4B
   +0x1cc DirectQueueLength : Uint4B
   +0x1d0 CanceledQueueLength : Uint4B
   +0x1d4 WaitQueueLength  : Uint4B
```  
  
  
AlpcpReceiveMessagePort会从_ALPC_PORT对象中获取消息队列MainQueue 中的消息。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmSd0xicNUfYQbZpa9ZgW0XBCSs0XwMyzNWt8jYSLOvQ7ohQD4qNU2MsKQ/640?wx_fmt=png&from=appmsg "")  
  
  
消息队列中的消息为nt!_KALPC_MESSAGE对象，如下所示可以看到取出的消息对象+0xf0的位置正是发送的3000008消息实体。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmShvTsdr3fKJiaibJibibGHvgaYrxlquzNMs383eY3aBQKopgKls5hdwzskg/640?wx_fmt=png&from=appmsg "")  
  
  
_KALPC_MESSAGE的结构如下所示，0x68开始就是MessageAttributes，0xf0则是对应的消息实体。  
  
![](https://mmbiz.qpic.cn/sz_mmbiz_png/2AqAgxkehic8w8noVE4qD1UXoq9ciaaWmS4EqAxSAldEYYEkHVvWusoPIXKgkWmDGXQVbCYJl65NnGsbVWHncDww/640?wx_fmt=png&from=appmsg "")  
  
  
之后对该_KALPC_MESSAGE进行一些设置，跳转到Label_19。  
  
